Tekla Open API Reference for Tekla Structures 2025
ComponentItem.Number Property
 The component item's internal number which is used by Tekla Structures in component identification.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Number { get; set; }
Public Property Number As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ComponentItem Class
Tekla.Structures.Catalogs Namespace